{
  "elonmusk": {
    "username": "elonmusk",
    "displayName": "Elon Musk",
    "verified": true,
    "followers": "150M",
    "bio": "Tesla, SpaceX, Neuralink, The Boring Company",
    "tweets": [
      "Working on making life multiplanetary. Mars colonization is essential for the long-term survival of consciousness.",
      "Just reviewed the latest Starship test results. We're getting closer to rapid reusability. This changes everything.",
      "AI safety cannot be overstated. We need proactive regulation before it's too late. The future of humanity depends on it.",
      "Production hell is real. But we're shipping 1000 Cybertrucks per week now. Ramping up faster than expected.",
      "Physics is the law, everything else is a recommendation. When solving hard problems, go back to first principles.",
      "The biggest problem humanity faces is declining birth rates. We need to address this urgently.",
      "Neuralink's brain-computer interface will enable telepathic communication within a decade. Not science fiction anymore.",
      "Efficiency matters. Every process should be questioned. Delete the part, then optimize. Most rules are wrong.",
      "We must become a spacefaring civilization. Either we expand to other planets or we face extinction.",
      "Tesla's goal has always been to accelerate the world's transition to sustainable energy. That mission remains unchanged.",
      "Don't confuse education with intelligence. You can have a PhD and still be an idiot.",
      "The best part is no part. The best process is no process. It weighs nothing, costs nothing, and can't fail.",
      "Work like hell. If other people are putting in 40-hour workweeks and you're putting in 100, you'll achieve in 4 months what takes them a year.",
      "When something is important enough, you do it even if the odds are not in your favor.",
      "I think we've got a good chance of making it to Mars in about 5-10 years. It's important that we become a multiplanetary species.",
      "The fundamental problem is that there are too many smart people working on making people click ads.",
      "Starting and growing a business is as much about the innovation, drive and determination as it is about the actual product.",
      "Brand is just a perception, and perception will match reality over time. Sometimes it will be ahead, other times it will be behind.",
      "Really pay attention to negative feedback and solicit it, particularly from friends. Hardly anyone does that, and it's incredibly helpful.",
      "If you're trying to create a company, it's like baking a cake. You have to have all the ingredients in the right proportion."
    ]
  },
  "BillGates": {
    "username": "BillGates",
    "displayName": "Bill Gates",
    "verified": true,
    "followers": "60M",
    "bio": "Co-chair of the Bill & Melinda Gates Foundation. Founder of Microsoft.",
    "tweets": [
      "I'm optimistic about the progress we're making on vaccines. Science and innovation will help us beat this pandemic.",
      "Climate change is one of the greatest challenges facing our generation. We need breakthrough innovations in energy.",
      "Reading is one of my favorite ways to learn. I just finished a fascinating book about the future of AI.",
      "The work of the Gates Foundation focuses on reducing inequity. Every child deserves a chance at a healthy, productive life.",
      "Innovation in agriculture can help small farmers increase their yields and improve their livelihoods.",
      "I believe that philanthropy should be measured by impact, not by dollars spent. We must focus on what works.",
      "Technology has the power to transform education. We're investing in tools that help teachers personalize learning.",
      "Clean energy innovation is critical. We need new ways to generate, store, and transmit electricity affordably.",
      "Global health is improving, but we still have a long way to go. Malaria, tuberculosis, and other diseases are still killing millions.",
      "I'm grateful for the opportunity to work on these challenges. It's the most fulfilling work I've ever done.",
      "Collaboration is key to solving big problems. No single organization can do it alone.",
      "Data and measurement help us understand what's working and what's not. We should make decisions based on evidence.",
      "I'm excited about the potential of artificial intelligence to accelerate scientific discovery.",
      "Investing in primary healthcare can save millions of lives and is one of the best investments we can make.",
      "Books continue to be one of my greatest sources of learning and inspiration. I read about 50 books a year.",
      "The world is getting better, even if it doesn't always feel that way. We've made tremendous progress in reducing poverty.",
      "I believe strongly in the power of capitalism to improve lives, but we need to make sure everyone benefits.",
      "Education is the great equalizer. We need to ensure every child has access to quality education.",
      "I'm hopeful about the future. With the right investments and policies, we can solve even our toughest challenges.",
      "Melinda and I have been so fortunate. We feel a responsibility to give back and help others who haven't had the same opportunities."
    ]
  },
  "naval": {
    "username": "naval",
    "displayName": "Naval",
    "verified": true,
    "followers": "2M",
    "bio": "Founder AngelList, Spearhead • Invested: Uber, Twitter, Yammer, Postmates...",
    "tweets": [
      "Seek wealth, not money or status. Wealth is having assets that earn while you sleep.",
      "Learn to sell. Learn to build. If you can do both, you will be unstoppable.",
      "Reading is faster than listening. Doing is faster than watching.",
      "Specific knowledge is found by pursuing your genuine curiosity and passion rather than whatever is hot right now.",
      "Play long-term games with long-term people. All returns in life come from compound interest.",
      "Pick business partners with high intelligence, energy, and above all, integrity.",
      "Arm yourself with specific knowledge, accountability, and leverage to get what you deserve.",
      "The internet has massively broadened the possible space of careers. Most people haven't figured this out yet.",
      "Code and media are permissionless leverage. They're the leverage behind the newly rich.",
      "If you can't decide, the answer is no. And the reason is, modern society is full of options.",
      "Happiness is a choice you make and a skill you develop. It's not something that just happens to you.",
      "Desire is a contract you make with yourself to be unhappy until you get what you want.",
      "The fundamental delusion: There is something out there that will make me happy and fulfilled forever.",
      "A fit body, a calm mind, a house full of love. These things cannot be bought — they must be earned.",
      "We're not really here for that long. So we might as well spend our time doing what we really want.",
      "Easy choices, hard life. Hard choices, easy life.",
      "Your real résumé is just a catalog of all your suffering. If you really want to be successful, you have to be willing to suffer.",
      "The most important skill for getting rich is becoming a perpetual learner.",
      "When you're finally wealthy, you'll realize it wasn't what you were seeking in the first place.",
      "The modern devil is cheap dopamine. Avoid it at all costs."
    ]
  },
  "sundarpichai": {
    "username": "sundarpichai",
    "displayName": "Sundar Pichai",
    "verified": true,
    "followers": "5M",
    "bio": "CEO of Google and Alphabet",
    "tweets": [
      "AI is one of the most profound things we're working on. It will transform how we approach everything.",
      "At Google, we believe in building products that help people and make their lives easier.",
      "Privacy and security are fundamental to everything we do. Users should have control over their data.",
      "I'm excited about the progress we're making in quantum computing. The potential applications are enormous.",
      "Collaboration across teams and countries is what makes Google special. We're solving problems together.",
      "Education is the key to unlocking opportunities. We're committed to making technology accessible to everyone.",
      "Our mission is to organize the world's information and make it universally accessible and useful.",
      "Search continues to evolve. We're making it more helpful and conversational with AI.",
      "YouTube has become the world's classroom. It's amazing to see how people learn and share knowledge.",
      "Android powers billions of devices. We're focused on making it faster, safer, and more helpful.",
      "Chrome has made the web faster and more secure for everyone. We'll keep innovating.",
      "Google Cloud is helping businesses transform with AI and data analytics. The future is in the cloud.",
      "Sustainability is a priority. We're committed to running on carbon-free energy 24/7 by 2030.",
      "I'm proud of our team's work on Google Assistant. It's becoming truly helpful in people's daily lives.",
      "Technology should work for everyone, not just the few. That's what drives our work on accessibility.",
      "We're investing heavily in research. The breakthroughs today will shape the products of tomorrow.",
      "I believe in the power of technology to solve big problems, from climate change to healthcare.",
      "Our responsibility is to build technology that respects users and helps society progress.",
      "I'm optimistic about the future. With AI and other technologies, we can tackle humanity's biggest challenges.",
      "What excites me most is seeing how our products impact billions of people around the world every day."
    ]
  },
  "BarackObama": {
    "username": "BarackObama",
    "displayName": "Barack Obama",
    "verified": true,
    "followers": "130M",
    "bio": "Dad, husband, President, citizen.",
    "tweets": [
      "We are the change we've been waiting for. Progress doesn't come from the sidelines.",
      "The future rewards those who press on. I don't have time to feel sorry for myself. I don't have time to complain.",
      "Change will not come if we wait for some other person or some other time. We are the ones we've been waiting for.",
      "Our democracy is strengthened when we engage with people who hold different views. We learn from one another.",
      "Climate change is not a hoax. It's not a distant threat. It's happening now, and we must act.",
      "Every young person deserves access to quality education. It's the foundation for everything else.",
      "Healthcare is not a privilege—it's a right. We made progress, but there's still work to do.",
      "I believe in American exceptionalism, but that means we have a responsibility to lead by example.",
      "Michelle and I are so proud of the work the Obama Foundation is doing to inspire and empower the next generation.",
      "Books continue to shape my thinking. Reading opens up new worlds and perspectives.",
      "The values we live by—kindness, empathy, hard work—are what define us.",
      "We must reject cynicism and embrace hope. Hope is what gave us the courage to fight for change.",
      "Service to others is the rent we pay for living on this planet. We all have a role to play.",
      "Justice is not a spectator sport. It requires active participation from all of us.",
      "We're living in extraordinary times. How we respond will determine the future we leave for our children.",
      "I'm optimistic about the future because I've seen what ordinary people can accomplish when they work together.",
      "Our democracy depends on an informed citizenry. Facts matter. Truth matters.",
      "The arc of the moral universe is long, but it bends toward justice—if we push it in that direction.",
      "Young people give me hope. Their passion, creativity, and determination will change the world.",
      "My time as President taught me that progress is possible, but it requires persistence and courage."
    ]
  }
}